Revit 2026 API

# SolidSurfaceArea Property

---

Returns the total surface area of this solid.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double SurfaceArea { get; }
```
```vb
Public ReadOnly Property SurfaceArea As Double
	Get
```
```cpp
public:
property double SurfaceArea {
	double get ();
}
```
```fsharp
member SurfaceArea : float with get
```

#### Return Value

DoubleThe real number equal to the total area of this solid.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when this solid is not a valid Geometry object. |

Calculates the surface area by adding together the areas of faces comprising this solid. Will slightly underestimate if curved surfaces are present.

#### Reference

Solid Class

Autodesk.Revit.DB Namespace